In [1]:
%matplotlib inline

import numpy as np
import pylab as plt
import pandas as pd

In [3]:
#Open data
su = pd.read_csv('su5m.csv')

In [5]:
su.head()

,Unnamed: 0,ccode,country,m1990,m2000,m2010,m2015,m2017,f1990,f2000,f2010,f2015,f2017
0,0,AFG,Afghanistan,180.1,133.5,94.2,77.2,71.8,169.7,123.8,85.5,68.8,63.7
1,1,ALB,Albania,43.7,26.7,13.0,10.1,9.5,36.4,22.2,11.0,8.6,8.1
2,2,DZA,Algeria,53.7,42.5,28.9,26.4,25.5,45.3,36.7,25.8,23.5,22.5
3,3,AND,Andorra,9.4,5.4,4.3,3.9,3.6,7.6,4.5,3.6,3.2,3.0
4,4,AGO,Angola,235.0,217.5,129.2,95.1,86.9,211.6,194.5,113.1,82.4,74.9

In [9]:
su['f2017/m2017'] = su['f2017']/su['m2017']

In [10]:
su.head()

,Unnamed: 0,ccode,country,m1990,m2000,m2010,m2015,m2017,f1990,f2000,f2010,f2015,f2017,avg-f-m,f2017/m2017
0,0,AFG,Afghanistan,180.1,133.5,94.2,77.2,71.8,169.7,123.8,85.5,68.8,63.7,67.75,0.887187
1,1,ALB,Albania,43.7,26.7,13.0,10.1,9.5,36.4,22.2,11.0,8.6,8.1,8.80,0.852632
2,2,DZA,Algeria,53.7,42.5,28.9,26.4,25.5,45.3,36.7,25.8,23.5,22.5,24.00,0.882353
3,3,AND,Andorra,9.4,5.4,4.3,3.9,3.6,7.6,4.5,3.6,3.2,3.0,3.30,0.833333
4,4,AGO,Angola,235.0,217.5,129.2,95.1,86.9,211.6,194.5,113.1,82.4,74.9,80.90,0.861910

In [11]:
#checked first row
63.7/71.8

0.8871866295264624

In [24]:
suclean=su[['country','f2017/m2017']]

In [26]:
suclean.head()

       country  f2017/m2017
0  Afghanistan     0.887187
1      Albania     0.852632
2      Algeria     0.882353
3      Andorra     0.833333
4       Angola     0.861910

In [28]:
suclean2=suclean.set_index('country')

In [30]:
suclean2.head()

             f2017/m2017
country
Afghanistan     0.887187
Albania         0.852632
Algeria         0.882353
Andorra         0.833333
Angola          0.861910

In [45]:
x=suclean2.loc['Afghanistan']
y=suclean2.loc['Albania']
x+y

f2017/m2017    1.739818
dtype: float64

In [39]:
list_ = []
not_done = True
while not_done:
    inp = input('name of string : ')
    if inp.lower() != 'done': # Put any string in stead of 'done' by which you intend to not take any more input
        list_.append(inp)
    else:
        break
print(list_)

name of string : payam
name of string : salam
name of string : chetory
name of string : done
['payam', 'salam', 'chetory']

FINALLLLLLLLLLLL

In [2]:
import os
import numpy as np
import pylab as plt
import pandas as pd

df = pd.read_csv('su5m.csv')
df['Result'] = df['f2017']/df['m2017']
df2=df.set_index('country')
list_ = []
not_done = True
while not_done:
    inp = input('name of string : ')
    if inp.lower() != 'done': # Put any string in stead of 'done' by which you intend to not take any more input
        list_.append(inp)
    else:
        break
list_ave=[]
for i in list_:
     print(df2['Result'].loc[i])
     list_ave.append(df2['Result'].loc[i])

a = np.array(list_ave)
print('the mean is=' ,a.mean())

name of string : Afghanistan
name of string : Albania
name of string : done
0.8871866295264624
0.8526315789473684
the mean is= 0.8699091042369154

In [ ]:
import os
import numpy as np
import pylab as plt
import pandas as pd
import sys

df = pd.read_csv('su5m.csv')
df['Result'] = df['f2017']/df['m2017']
df2=df.set_index('country')
list_ = sys.argv[1]

list_ave=[]
for i in list_:
     print(df2['Result'].loc[i])
     list_ave.append(df2['Result'].loc[i])

a = np.array(list_ave)
print('the mean is=' ,a.mean())